Тест_ЗУП_31_КОРП/src/Documents/РезультатыАттестацииСотрудников/РезультатыАттестацииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезультатыАттестацииСотрудников</name>
  <registerRecords>InformationRegister.УдалитьЗначенияСовокупныхТарифныхСтавокСотрудников</registerRecords>
  <registerRecords>InformationRegister.ВнеочередныеАттестацииСотрудников</registerRecords>
  <registerRecords>InformationRegister.РазрядыКатегорииСотрудников</registerRecords>
  <registerRecords>InformationRegister.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников</registerRecords>
  <registerRecords>InformationRegister.БухучетПлановыхНачислений</registerRecords>
  <registerRecords>InformationRegister.РезультатыАттестацийСотрудников</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисления</registerRecords>
  <registerRecords>InformationRegister.ИсторияКадровогоРезерва</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриказОбАттестации</name>
    <type>
      <types>DocumentRef.НаправлениеНаВнешнююАттестацию</types>
      <types>DocumentRef.ПриказОбАттестацииСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАттестации</name>
    <type>
      <types>CatalogRef.ВидыАттестацийСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменитьОплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьГодАттестации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РезультатыАттестации</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаАттестации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Специальность</name>
      <type>
        <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.РазрядыКатегорииДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатАттестации</name>
      <type>
        <types>EnumRef.РезультатыПодтвержденияКвалификацииПоСпециальности</types>
        <types>EnumRef.РезультатыАттестацииНаСоответствиеДолжности</types>
      </type>
    </attributes>
    <attributes>
      <name>РешениеКомиссии</name>
      <type>
        <types>CatalogRef.РешенияАттестационныхКомиссий</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВнеочереднойАттестации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПозицияРезерва</name>
      <type>
        <types>CatalogRef.КадровыйРезерв</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРезерва</name>
      <type>
        <types>CatalogRef.ВидыКадровогоРезерва</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КемВыданДокумент</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СовокупнаяТарифнаяСтавка</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидТарифнойСтавки</name>
      <type>
        <types>EnumRef.ВидыТарифныхСтавок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставАттестационнойКомиссии</name>
    <attributes>
      <name>ЧленКомиссии</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РольВКомиссии</name>
      <type>
        <types>EnumRef.РолиЧленовАттестационнойКомиссии</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияСНачислениямиИУдержаниями</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ОснованиеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ОснованиеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияСНачислениямиИУдержаниями</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/InformationRegisters/СпециальностиФизическихЛиц/СпециальностиФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпециальностиФизическихЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>РазрядКатегория</name>
    <type>
      <types>CatalogRef.РазрядыКатегорииДолжностей</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.РезультатыАттестацииСотрудников</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/Enums/ТипыАттестацииСотрудников/ТипыАттестацииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыАттестацииСотрудников</name>
  <enumValues>
    <name>ПодтверждениеСоответствияДолжности</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеКвалификацииПоСпециальности</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/РезультатыПодтвержденияКвалификацииПоСпециальности/РезультатыПодтвержденияКвалификацииПоСпециальности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатыПодтвержденияКвалификацииПоСпециальности</name>
  <enumValues>
    <name>КвалификацияПодтверждена</name>
  </enumValues>
  <enumValues>
    <name>КвалификацияНеПодтверждена</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/ДействияСНачислениямиИУдержаниями/ДействияСНачислениямиИУдержаниями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействияСНачислениямиИУдержаниями</name>
  <enumValues>
    <name>Утвердить</name>
  </enumValues>
  <enumValues>
    <name>Отменить</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Documents/РезультатыАттестацииСотрудников/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если АттестацииСотрудников.ЭтоВнешняяАттестация(ВидАттестации) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "СоставАттестационнойКомиссии");
	КонецЕсли;
	
	Если АттестацииСотрудников.ТипАттестации(ВидАттестации) = Перечисления.ТипыАттестацииСотрудников.ПодтверждениеСоответствияДолжности Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "РезультатыАттестации.Специальность");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "РезультатыАттестации.Категория");
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "РезультатыАттестации.Должность");
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("КадровыйРезерв");
		Модуль.ПроверитьЗаполнениеВидаРезерваВТабличнойЧасти(ЭтотОбъект, "РезультатыАттестации", ПроверяемыеРеквизиты, Отказ, Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "РезультатыАттестации.ПозицияРезерва");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "РезультатыАттестации.ВидРезерва");
	КонецЕсли;
	
	Сотрудники = ОбщегоНазначения.ВыгрузитьКолонку(РезультатыАттестации, "Сотрудник");
	ФизическиеЛицаСотрудников = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Сотрудники, "ФизическоеЛицо");
	
	УникальныеФизическиеЛица = Новый Соответствие;
	
	Для Каждого СтрокаСотрудника Из РезультатыАттестации Цикл 
		ФизическоеЛицо = ФизическиеЛицаСотрудников[СтрокаСотрудника.Сотрудник];
		Если УникальныеФизическиеЛица[ФизическоеЛицо] = Неопределено Тогда 
			УникальныеФизическиеЛица.Вставить(ФизическоеЛицо, Истина);
			Продолжить;
		КонецЕсли;
		ИндексСтроки = РезультатыАттестации.Индекс(СтрокаСотрудника);
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Информация о работнике %1 уже была введена в документе ранее'"), СтрокаСотрудника.Сотрудник);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "Объект.РезультатыАттестации[" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0") + "].Сотрудник", ,Отказ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ЗарплатаКадрыРасширенный.ИнициализироватьОтложеннуюРегистрациюВторичныхДанныхПоДвижениямДокумента(Движения);
	
	ОчиститьСпециальностиФизическихЛиц();
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	
	ЗарплатаКадрыРасширенный.УстановитьВремяРегистрацииДокумента(Движения, ДанныеДляПроведения.СотрудникиДаты, Ссылка);
	
	АттестацииСотрудников.СформироватьДвиженияРезультатыАттестации(Движения, Отказ, ДанныеДляПроведения.РезультатыАттестации);
	АттестацииСотрудников.СформироватьДвиженияВнеочередныеАттестацииСотрудников(Движения, Отказ, ДанныеДляПроведения.ВнеочередныеАттестации);
	
	Если ЭтоПодтверждениеКвалификацииПоСпециальности() Тогда
		РегистрыСведений.СпециальностиФизическихЛиц.ЗарегистрироватьСпециальностиФизическихЛиц(ДанныеДляПроведения.СпециальностиФизическихЛиц);
		
		Если ИзменитьОплату Тогда
			СтруктураПлановыхНачислений = Новый Структура;
			СтруктураПлановыхНачислений.Вставить("ДанныеОПлановыхНачислениях", ДанныеДляПроведения.ПлановыеНачисления);
			СтруктураПлановыхНачислений.Вставить("ЗначенияПоказателей", ДанныеДляПроведения.ЗначенияПоказателей);
			РасчетЗарплаты.СформироватьДвиженияПлановыхНачислений(ЭтотОбъект, ЭтотОбъект.Движения, СтруктураПлановыхНачислений);
			РазрядыКатегорииДолжностей.СформироватьДвиженияРазрядовКатегорийСотрудников(ЭтотОбъект.Движения, ДанныеДляПроведения.РазрядыКатегорииСотрудников);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("КадровыйРезерв");
		Модуль.СформироватьДвиженияИсторииКадровогоРезерва(Движения, ДанныеДляПроведения, "ДанныеКадровогоРезерва");
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОчиститьСпециальностиФизическихЛиц();
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЗарплатаКадрыРасширенный.ПриКопированииМногофункциональногоДокумента(ЭтотОбъект);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадрыРасширенный.ПередЗаписьюМногофункциональногоДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру параметров для ограничения регистрации объекта при обмене
// Вызывается ПередЗаписью объекта.
//
// Возвращаемое значение:
//	ОграниченияРегистрации - Структура - Описание см. ОбменДаннымиЗарплатаКадры.ОграниченияРегистрации.
//
Функция ОграниченияРегистрации() Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый Структура("РезультатыАттестации", "Сотрудник"));
	
	Возврат ОбменДаннымиЗарплатаКадры.ОграниченияРегистрацииПоОрганизацииИСотрудникам(ЭтотОбъект, Организация, МассивПараметров, Дата);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	ДанныеДляПроведения = Новый Структура();
	ДанныеДляПроведения.Вставить("МенеджерВременныхТаблиц", 		Новый МенеджерВременныхТаблиц);
	ДанныеДляПроведения.Вставить("РезультатыАттестации", 			Неопределено);
	ДанныеДляПроведения.Вставить("ВнеочередныеАттестации", 			Неопределено);
	ДанныеДляПроведения.Вставить("СпециальностиФизическихЛиц", 		Неопределено);
	ДанныеДляПроведения.Вставить("ПлановыеНачисления", 				Неопределено);
	ДанныеДляПроведения.Вставить("ЗначенияПоказателей", 			Неопределено);
	ДанныеДляПроведения.Вставить("ДанныеСовокупныхТарифныхСтавок", 	Неопределено);
	ДанныеДляПроведения.Вставить("РазрядыКатегорииСотрудников", 	Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("КвалификацияПодтверждена", Перечисления.РезультатыПодтвержденияКвалификацииПоСпециальности.КвалификацияПодтверждена);
	
	СоздатьВТРезультатыАттестацийСотрудников(Запрос, ДанныеДляПроведения);
	
	ДобавитьДанныеДляПроведенияРезультатыАттестации(Запрос, ДанныеДляПроведения);
	ДобавитьДанныеДляПроведенияВнеочередныеАттестации(Запрос, ДанныеДляПроведения);
		
	Если ЭтоПодтверждениеКвалификацииПоСпециальности() Тогда
		ДобавитьДанныеДляПроведенияСпециальностиФизическихЛиц(Запрос, ДанныеДляПроведения);
		
		Если ИзменитьОплату Тогда
			ДобавитьДанныеДляПроведенияПлановыеНачисления(Запрос, ДанныеДляПроведения);
			ДобавитьДанныеДляПроведенияЗначенияПоказателей(Запрос, ДанныеДляПроведения);
			ДобавитьДанныеДляПроведенияДанныеСовокупныхТарифныхСтавок(Запрос, ДанныеДляПроведения);
			ДобавитьДанныеДляПроведенияРазрядыКатегорииСотрудников(Запрос, ДанныеДляПроведения);
		КонецЕсли;
		
	КонецЕсли;
	
	ДобавитьДанныеДляПроведенияПоКадровомуРезерву(ДанныеДляПроведения);
	ДобавитьДанныеОВремениРегистрацииПлановыхНачислений(Запрос, ДанныеДляПроведения);
	
	Возврат ДанныеДляПроведения;	
	
КонецФункции 

Процедура СоздатьВТРезультатыАттестацийСотрудников(Запрос, ДанныеДляПроведения)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧРезультатыАттестации.Сотрудник,
	|	ТЧРезультатыАттестации.ДатаАттестации КАК Период
	|ПОМЕСТИТЬ ВТСотрудникиПериоды
	|ИЗ
	|	Документ.РезультатыАттестацииСотрудников.РезультатыАттестации КАК ТЧРезультатыАттестации
	|ГДЕ
	|	ТЧРезультатыАттестации.Ссылка = &Ссылка";
	
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(ДанныеДляПроведения.МенеджерВременныхТаблиц, "ВТСотрудникиПериоды");
	КадровыеДанные = "ГоловнаяОрганизация,ФизическоеЛицо";
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧРезультатыАттестации.Сотрудник,
	|	ТЧРезультатыАттестации.Должность,
	|	ТЧРезультатыАттестации.РезультатАттестации,
	|	ТЧРезультатыАттестации.РешениеКомиссии,
	|	ТЧРезультатыАттестации.ДатаВнеочереднойАттестации,
	|	ТЧРезультатыАттестации.ПозицияРезерва,
	|	ТЧРезультатыАттестации.ВидРезерва,
	|	ТЧРезультатыАттестации.ДатаАттестации КАК Период,
	|	ТЧРезультатыАттестации.ДатаАттестации,
	|	ТЧРезультатыАттестации.ДатаОкончания,
	|	ТЧРезультатыАттестации.Ссылка.ВидАттестации КАК ВидАттестации,
	|	ТЧРезультатыАттестации.Ссылка.Организация КАК Организация,
	|	ВТКадровыеДанныеСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ТЧРезультатыАттестации.Специальность,
	|	ТЧРезультатыАттестации.Категория,
	|	ТЧРезультатыАттестации.СерияДокумента,
	|	ТЧРезультатыАттестации.НомерДокумента,
	|	ТЧРезультатыАттестации.КемВыданДокумент,
	|	ТЧРезультатыАттестации.Основание,
	|	ТЧРезультатыАттестации.Ссылка,
	|	ВТКадровыеДанныеСотрудников.ФизическоеЛицо,
	|	ТЧРезультатыАттестации.СовокупнаяТарифнаяСтавка,
	|	ТЧРезультатыАттестации.ВидТарифнойСтавки
	|ПОМЕСТИТЬ ВТРезультатыАттестацийСотрудников
	|ИЗ
	|	Документ.РезультатыАттестацииСотрудников.РезультатыАттестации КАК ТЧРезультатыАттестации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК ВТКадровыеДанныеСотрудников
	|		ПО ТЧРезультатыАттестации.Сотрудник = ВТКадровыеДанныеСотрудников.Сотрудник
	|			И ТЧРезультатыАттестации.ДатаАттестации = ВТКадровыеДанныеСотрудников.Период
	|ГДЕ
	|	ТЧРезультатыАттестации.Ссылка = &Ссылка";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьДанныеДляПроведенияРезультатыАттестации(Запрос, ДанныеДляПроведения)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РезультатыАттестации.ДатаАттестации КАК Период,
	|	РезультатыАттестации.Сотрудник,
	|	РезультатыАттестации.Должность,
	|	РезультатыАттестации.РезультатАттестации,
	|	РезультатыАттестации.РешениеКомиссии,
	|	РезультатыАттестации.ВидАттестации
	|ИЗ
	|	ВТРезультатыАттестацийСотрудников КАК РезультатыАттестации";
	
	ДанныеДляПроведенияРезультатыАттестации = Запрос.Выполнить().Выгрузить();
	
	ДанныеДляПроведения.Вставить("РезультатыАттестации", ДанныеДляПроведенияРезультатыАттестации);
	
КонецПроцедуры

Процедура ДобавитьДанныеДляПроведенияВнеочередныеАттестации(Запрос, ДанныеДляПроведения)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнеочередныеАттестации.ДатаАттестации КАК Период,
	|	ВнеочередныеАттестации.Сотрудник,
	|	ВнеочередныеАттестации.ДатаВнеочереднойАттестации,
	|	ВнеочередныеАттестации.ВидАттестации
	|ИЗ
	|	ВТРезультатыАттестацийСотрудников КАК ВнеочередныеАттестации
	|ГДЕ
	|	ВнеочередныеАттестации.ДатаВнеочереднойАттестации <> &ПустаяДата";
	
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	ДанныеДляПроведенияВнеочередныеАттестации = Запрос.Выполнить().Выгрузить();
	
	ДанныеДляПроведения.Вставить("ВнеочередныеАттестации", ДанныеДляПроведенияВнеочередныеАттестации);
	
КонецПроцедуры

Процедура ДобавитьДанныеДляПроведенияСпециальностиФизическихЛиц(Запрос, ДанныеДляПроведения)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СпециальностиФизическихЛиц.ДатаАттестации КАК Период,
	|	СпециальностиФизическихЛиц.Сотрудник,
	|	СпециальностиФизическихЛиц.ФизическоеЛицо,
	|	СпециальностиФизическихЛиц.Специальность,
	|	СпециальностиФизическихЛиц.Категория КАК РазрядКатегория,
	|	СпециальностиФизическихЛиц.СерияДокумента КАК Серия,
	|	СпециальностиФизическихЛиц.НомерДокумента КАК Номер,
	|	СпециальностиФизическихЛиц.КемВыданДокумент КАК КемВыдан,
	|	СпециальностиФизическихЛиц.Основание,
	|	СпециальностиФизическихЛиц.ДатаОкончания КАК ДействуетПо,
	|	СпециальностиФизическихЛиц.Ссылка КАК ДокументРегистратор
	|ИЗ
	|	ВТРезультатыАттестацийСотрудников КАК СпециальностиФизическихЛиц
	|ГДЕ
	|	СпециальностиФизическихЛиц.РезультатАттестации = &КвалификацияПодтверждена";
	
	ДанныеДляПроведенияСпециальностиФизическихЛиц = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("СпециальностиФизическихЛиц", ДанныеДляПроведенияСпециальностиФизическихЛиц);
	
КонецПроцедуры

Процедура ДобавитьДанныеДляПроведенияПлановыеНачисления(Запрос, ДанныеДляПроведения)
		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.ДатаАттестации КАК ДатаСобытия,
		|	ВЫБОР
		|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
		|		ИНАЧЕ Сотрудники.ДатаОкончания
		|	КОНЕЦ КАК ДействуетДо,
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Начисления.Начисление,
		|	Начисления.ДокументОснование,
		|	ВЫБОР
		|		КОГДА Начисления.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.Отменить)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Используется,
		|	ВЫБОР
		|		КОГДА Начисления.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.Отменить)
		|			ТОГДА ИСТИНА
		|		КОГДА Начисления.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.Утвердить)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ИспользуетсяПоОкончании,
		|	Начисления.Размер,
		|	Сотрудники.ФизическоеЛицо,
		|	Сотрудники.ГоловнаяОрганизация
		|ИЗ
		|	Документ.РезультатыАттестацииСотрудников.Начисления КАК Начисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРезультатыАттестацийСотрудников КАК Сотрудники
		|		ПО Начисления.Ссылка = Сотрудники.Ссылка
		|			И Начисления.Сотрудник = Сотрудники.Сотрудник
		|ГДЕ
		|	Начисления.Ссылка = &Ссылка";
			
	ПлановыеНачисления = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ПлановыеНачисления", ПлановыеНачисления);
	
КонецПроцедуры

Процедура ДобавитьДанныеДляПроведенияЗначенияПоказателей(Запрос, ДанныеДляПроведения)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Организация,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо,
	|	Сотрудники.ДатаАттестации КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
	|		ИНАЧЕ Сотрудники.ДатаОкончания
	|	КОНЕЦ КАК ДействуетДо,
	|	Показатели.Показатель,
	|	Показатели.Значение,
	|	Начисления.ДокументОснование
	|ИЗ
	|	Документ.РезультатыАттестацииСотрудников.Показатели КАК Показатели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРезультатыАттестацийСотрудников КАК Сотрудники
	|		ПО Показатели.Ссылка = Сотрудники.Ссылка
	|			И Показатели.Сотрудник = Сотрудники.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РезультатыАттестацииСотрудников.Начисления КАК Начисления
	|		ПО Показатели.Ссылка = Начисления.Ссылка
	|			И Показатели.Сотрудник = Начисления.Сотрудник
	|			И Показатели.ИдентификаторСтрокиВидаРасчета = Начисления.ИдентификаторСтрокиВидаРасчета
	|ГДЕ
	|	Показатели.Ссылка = &Ссылка
	|	И Показатели.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиРасчетаЗарплаты.ПустаяСсылка)";
	
	ЗначенияПоказателей = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ЗначенияПоказателей", ЗначенияПоказателей);
	
КонецПроцедуры

Процедура ДобавитьДанныеДляПроведенияДанныеСовокупныхТарифныхСтавок(Запрос, ДанныеДляПроведения)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ДатаАттестации КАК ДатаСобытия,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.СовокупнаяТарифнаяСтавка КАК Значение,
	|	ВЫБОР
	|		КОГДА Сотрудники.СовокупнаяТарифнаяСтавка = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыТарифныхСтавок.ПустаяСсылка)
	|		ИНАЧЕ Сотрудники.ВидТарифнойСтавки
	|	КОНЕЦ КАК ВидТарифнойСтавки,
	|	Сотрудники.ДатаОкончания КАК ДействуетДо
	|ИЗ
	|	ВТРезультатыАттестацийСотрудников КАК Сотрудники";
	
	ДанныеСовокупныхТарифныхСтавок = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ДанныеСовокупныхТарифныхСтавок", ДанныеСовокупныхТарифныхСтавок);
	
КонецПроцедуры

Процедура ДобавитьДанныеДляПроведенияРазрядыКатегорииСотрудников(Запрос, ДанныеДляПроведения)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ДатаАттестации КАК ДатаСобытия,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.Категория КАК РазрядКатегория,
	|	Сотрудники.ДатаОкончания КАК ДействуетДо
	|ИЗ
	|	ВТРезультатыАттестацийСотрудников КАК Сотрудники
	|ГДЕ
	|	Сотрудники.РезультатАттестации = &КвалификацияПодтверждена";

	РазрядыКатегорииСотрудников = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("РазрядыКатегорииСотрудников", РазрядыКатегорииСотрудников);
	
КонецПроцедуры

Процедура ДобавитьДанныеДляПроведенияПоКадровомуРезерву(ДанныеДляПроведения)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("КадровыйРезерв");
		ДанныеКадровогоРезерва = Модуль.ДанныеКадровыйРезервДляРезультатыАттестацииСотрудников(ДанныеДляПроведения);
		ДанныеДляПроведения.Вставить("ДанныеКадровогоРезерва", ДанныеКадровогоРезерва);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДанныеОВремениРегистрацииПлановыхНачислений(Запрос, ДанныеДляПроведения)
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.ДатаАттестации КАК ДатаСобытия,
	|	Сотрудники.Сотрудник КАК Сотрудник
	|ИЗ
	|	ВТРезультатыАттестацийСотрудников КАК Сотрудники";

	СотрудникиДаты = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("СотрудникиДаты", СотрудникиДаты);
	
КонецПроцедуры

Функция ЭтоПодтверждениеКвалификацииПоСпециальности()
	
	Возврат АттестацииСотрудников.ТипАттестации(ВидАттестации) = Перечисления.ТипыАттестацииСотрудников.ПодтверждениеКвалификацииПоСпециальности;

КонецФункции

Процедура ОчиститьСпециальностиФизическихЛиц()
	РегистрыСведений.СпециальностиФизическихЛиц.ОчиститьСпециальностиФизическихЛиц(Ссылка);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
